// BSLLS-off
#Использовать 1commands

ПутьКОтчетуJUnit = ОбъединитьПути(".", "build", "reports", "junit.xml");
КаталогОтчетов = ОбъединитьПути(".", "build", "reports");
Файл = Новый Файл(КаталогОтчетов);
Если Не Файл.Существует() Тогда
    СоздатьКаталог(КаталогОтчетов);
КонецЕсли;

Команда = Новый Команда;
Команда.УстановитьКоманду("oneunit");
Команда.ДобавитьПараметр("execute");
Команда.ДобавитьПараметр("-d tests");
Команда.ДобавитьПараметр("-r");
Команда.ДобавитьПараметр("--junit " + ПутьКОтчетуJUnit);
Команда.ПоказыватьВыводНемедленно(Истина);

КодВозврата = Команда.Исполнить();

Если КодВозврата <> 0 Тогда
    ВызватьИсключение "Тестирование завершилось неудачно!";
КонецЕсли;
